read_verilog xs3.v
prep -top xs3
show -format svg -prefix xs3_map
